Конструктор_документов/src/Catalogs/ШаблоныВнутреннихДокументов/ШаблоныВнутреннихДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШаблоныВнутреннихДокументов</name>
  <comment>Справочник шаблонов внутренних документов</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Автозаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Адресат</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыВнутреннихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВопросДеятельности</name>
    <type>
      <types>CatalogRef.ВопросыДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрифДоступа</name>
    <type>
      <types>CatalogRef.ГрифыДоступа</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьИсполнения</name>
    <comment>Длительность исполнения внутреннего документа</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнениеНаименованияПоШаблону</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьИзменятьРеквизитыИзШаблона</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьРедактироватьФайлы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьУдалятьФайлы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКДокументу</name>
    <comment>Комментарий к внутреннему документу</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКШаблону</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураДел</name>
    <type>
      <types>CatalogRef.НоменклатураДел</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Папка</name>
    <type>
      <types>CatalogRef.ПапкиВнутреннихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Подписант</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <comment>Статья движения денежных средств</comment>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ГрифыУтверждения</name>
    <attributes>
      <name>АвторУтверждения</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсполнителиСогласования</name>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.ПолныеРоли</types>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьИсполнитель</name>
      <type>
        <types>CatalogRef.РолиИсполнителей</types>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьОсновнойОбъектАдресации</name>
      <type>
        <types>Characteristic.ОбъектыАдресацииЗадач</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьДополнительныйОбъектАдресации</name>
      <type>
        <types>Characteristic.ОбъектыАдресацииЗадач</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Категории</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>CatalogRef.КатегорииДанных</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Контрагенты</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>CatalogRef.КонтактныеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПравилаАвтозаполнения</name>
    <attributes>
      <name>ШаблонФайла</name>
      <type>
        <types>CatalogRef.Файлы</types>
      </type>
    </attributes>
    <attributes>
      <name>ПравилоАвтозаполнения</name>
      <type>
        <types>CatalogRef.ПравилаАвтозаполненияФайлов</types>
      </type>
    </attributes>
    <attributes>
      <name>кпдКонструкторДокумента</name>
      <type>
        <types>CatalogRef.кпдКонструкторДокументов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПрикрепленныеФайлы</name>
    <attributes>
      <name>ФайлСсылка</name>
      <type>
        <types>CatalogRef.Файлы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РабочаяГруппаДокумента</name>
    <attributes>
      <name>Изменение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Иконка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьДополнительныйОбъектАдресации</name>
      <type>
        <types>Characteristic.ОбъектыАдресацииЗадач</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьОсновнойОбъектАдресации</name>
      <type>
        <types>Characteristic.ОбъектыАдресацииЗадач</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьУчастник</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
        <types>CatalogRef.РолиИсполнителей</types>
        <types>CatalogRef.РабочиеГруппы</types>
        <types>String</types>
        <types>CatalogRef.Пользователи</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Участник</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
        <types>CatalogRef.РабочиеГруппы</types>
        <types>String</types>
        <types>CatalogRef.ПолныеРоли</types>
        <types>CatalogRef.Пользователи</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоРоль</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Стороны</name>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.КонтактныеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>CatalogRef.НаименованияСторон</types>
      </type>
    </attributes>
    <attributes>
      <name>Подписант</name>
      <type>
        <types>String</types>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.КонтактныеЛица</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сторона</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьНаименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Конструктор_документов/src/Catalogs/кпдРазделыДокументов/кпдРазделыДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>кпдРазделыДокументов</name>
  <owners>Catalog.кпдКонструкторДокументов</owners>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Варианты</name>
    <attributes>
      <name>НазваниеВарианта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФайлСсылка</name>
      <type>
        <types>CatalogRef.Файлы</types>
      </type>
    </attributes>
    <attributes>
      <name>ПравилоАвтозаполнения</name>
      <type>
        <types>CatalogRef.ПравилаАвтозаполненияФайлов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантПоУмолчанию</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Номер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Конструктор_документов/src/CommonForms/кпдКонструкторДокументов/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ШаблоныВнутреннихДокументовПравилаАвтозаполнения.Ссылка КАК Ссылка,
	|	ШаблоныВнутреннихДокументовПравилаАвтозаполнения.НомерСтроки КАК НомерСтроки,
	|	ШаблоныВнутреннихДокументовПравилаАвтозаполнения.ШаблонФайла КАК ШаблонФайла,
	|	ШаблоныВнутреннихДокументовПравилаАвтозаполнения.ПравилоАвтозаполнения КАК ПравилоАвтозаполнения,
	|	ШаблоныВнутреннихДокументовПравилаАвтозаполнения.кпдКонструкторДокумента КАК кпдКонструкторДокумента
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Справочник.ШаблоныВнутреннихДокументов.ПравилаАвтозаполнения КАК ШаблоныВнутреннихДокументовПравилаАвтозаполнения
	|ГДЕ
	|	ШаблоныВнутреннихДокументовПравилаАвтозаполнения.кпдКонструкторДокумента = &Конструктор
	|	И ШаблоныВнутреннихДокументовПравилаАвтозаполнения.ШаблонФайла = &ШаблонФайла
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	кпдРазделыДокументовВарианты.Ссылка КАК Раздел,
	|	кпдРазделыДокументовВарианты.Ссылка.Порядок КАК Порядок,
	|	кпдРазделыДокументовВарианты.Ссылка.Наименование КАК Наименование,
	|	кпдРазделыДокументовВарианты.НазваниеВарианта КАК НазваниеВарианта,
	|	кпдРазделыДокументовВарианты.НомерСтроки КАК НомерВарианта,
	|	кпдРазделыДокументовВарианты.ВариантПоУмолчанию КАК ВариантПоУмолчанию,
	|	кпдРазделыДокументовВарианты.Ссылка.Владелец КАК Владелец,
	|	ВТ.ШаблонФайла КАК ШаблонФайла,
	|	ВТ.ПравилоАвтозаполнения КАК ПравилоАвтозаполнения
	|ИЗ
	|	Справочник.кпдРазделыДокументов.Варианты КАК кпдРазделыДокументовВарианты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ КАК ВТ
	|		ПО кпдРазделыДокументовВарианты.Ссылка.Владелец = ВТ.кпдКонструкторДокумента.Ссылка
	|ГДЕ
	|	кпдРазделыДокументовВарианты.Ссылка.Владелец = &Конструктор
	|	И НЕ кпдРазделыДокументовВарианты.ФайлСсылка.ПометкаУдаления
	|	И НЕ кпдРазделыДокументовВарианты.Ссылка.ПометкаУдаления
	|	И ВТ.ПравилоАвтозаполнения <> ЗНАЧЕНИЕ(Справочник.ПравилаАвтозаполненияФайлов.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерВарианта
	|ИТОГИ ПО
	|	Раздел
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ";
	
	Запрос.УстановитьПараметр("Конструктор", Параметры.Конструктор);
	Запрос.УстановитьПараметр("ШаблонФайла", Параметры.ШаблонОснование);
		
	ВыборкаРаздел = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	НомерРаздела = 1;
	Пока ВыборкаРаздел.Следующий() Цикл
		НаименованиеРаздела = ВыборкаРаздел.Раздел.Наименование;
		//исправить - наимен может содержать пробелы!
		ИмяРаздела = ВыборкаРаздел.Раздел.Наименование;
		
		////Добавляем группировку
		//ЭлементГруппировки = ЭтаФорма.Элементы.Добавить("Группировка"+ Строка(НомерРаздела), Тип("ГруппаФормы"), ЭтаФорма);
		
		//Добавляем реквизит
		Реквизит = Новый РеквизитФормы(ИмяРаздела, Новый ОписаниеТипов("Строка"),, НаименованиеРаздела);
		
		нРеквизиты = Новый Массив;
		нРеквизиты.Добавить(Реквизит);
		ИзменитьРеквизиты(нРеквизиты);
		
		//Добавляем поле ввода
		Элемент = ЭтаФорма.Элементы.Добавить(ИмяРаздела, Тип("ПолеФормы"), ЭтаФорма);
		Элемент.Вид = ВидПоляФормы.ПолеНадписи;
		Элемент.ПутьКДанным = НаименованиеРаздела;
		
		
		НомерВарианта = 1;
		ВыборкаДетальныеЗаписи = ВыборкаРаздел.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если НомерВарианта = 1 Тогда	
				//Добавляем реквизит
				Реквизит = Новый РеквизитФормы(ИмяРаздела + "ВариантыРаздела", Новый ОписаниеТипов("Строка"),, "Варианты раздела");
				нРеквизиты = Новый Массив;
				нРеквизиты.Добавить(Реквизит);
				ИзменитьРеквизиты(нРеквизиты);
				
				//Добавляем поле ввода
				Элемент = ЭтаФорма.Элементы.Добавить(ИмяРаздела + "ВариантыРаздела", Тип("ПолеФормы"), ЭтаФорма);
				Элемент.Вид = ВидПоляФормы.ПолеПереключателя;
				Элемент.ПутьКДанным = ИмяРаздела + "ВариантыРаздела";
				Элемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
				Элемент.КоличествоКолонок = 1;
				
				Элемент.СписокВыбора.Добавить(ВыборкаДетальныеЗаписи.НазваниеВарианта);
				Если ВыборкаДетальныеЗаписи.ВариантПоУмолчанию Тогда
					ЭтотОбъект.ЭтаФорма[ИмяРаздела + "ВариантыРаздела"] = ВыборкаДетальныеЗаписи.НазваниеВарианта;	
				КонецЕсли;
			Иначе
				Элемент.СписокВыбора.Добавить(ВыборкаДетальныеЗаписи.НазваниеВарианта);
				Если ВыборкаДетальныеЗаписи.ВариантПоУмолчанию Тогда
					ЭтотОбъект.ЭтаФорма[ИмяРаздела + "ВариантыРаздела"] = ВыборкаДетальныеЗаписи.НазваниеВарианта;	
				КонецЕсли;	
			КонецЕсли;
			
			НомерВарианта = НомерВарианта + 1;
		КонецЦикла;
		НомерРаздела = НомерРаздела + 1;
		
	КонецЦикла;
	
	//Добавляем команду
	Элемент2 = ЭтаФорма.Элементы.Добавить("Кнопка1", Тип("КнопкаФормы"), ЭтаФорма);
	Элемент2.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	Элемент2.ИмяКоманды = "Сформировать";
		
	ШаблонОснование = Параметры.ШаблонОснование;
	Элементы.ДекорацияКП.Заголовок = "Конструктор: " + Параметры.Конструктор;
	Элементы.ДекорацияШаблон.Заголовок = "Файл:  " + Параметры.ШаблонОснование;
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	ВариантыРазделов.Очистить();
	
	Для Каждого Элемент из Элементы Цикл
		
		Если ТипЗнч(Элемент) = Тип("ПолеФормы") И Элемент.Вид = ВидПоляФормы.ПолеНадписи Тогда
			Раздел = Элемент.Имя;
			
			Для Каждого Элемент из Элементы Цикл
				
				Если ТипЗнч(Элемент) = Тип("ПолеФормы") И Элемент.Вид = ВидПоляФормы.ПолеПереключателя Тогда
					РезультатПоиска = СтрНайти(Элемент.Имя, Раздел);
					Если РезультатПоиска <> 0 Тогда 
						ИмяРеквизита = Раздел + "ВариантыРаздела"; 
						ЗначениеРеквизита = ЭтотОбъект.ЭтаФорма[ИмяРеквизита];
						Если ЗначениеЗаполнено(ЗначениеРеквизита) Тогда 
							НовСтрока = ВариантыРазделов.Добавить();
							НовСтрока.Раздел = Раздел;
							НовСтрока.ВариантРаздела = ЗначениеРеквизита;
							НовСтрока.ШаблонОснование = ШаблонОснование;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЭтаФорма.Закрыть(ВариантыРазделов);	
	
КонецПроцедуры
